// 기본과제
// 숫자 야구 게임
// 컴퓨터가 숫자 3개를 고른다.
// 사람이 숫자 3개를 입력한다.
// 숫자가 같고 위치가 같으면 스트라이크
// 숫자만 같으면 위치가 다르면 볼
// 같은 숫자가 없으면 아웃
// 입력해서 몇번만에 3스트라이크, 즉 숫자를 맞추는지 하는 게임
// 123 -> 321, 1스트라이크, 2볼
// 123 -> 456, 3아웃
// 아래에 해당하지 않는 사람들은 그림을 그려와
// https://app.diagrams.net/

// 정현, 재훈, 성진, 우석, 영준, 정규, 혜림
// 피보나치 수, 하노이의 탑
// 피보나치 1, 1, 2, 3, 5, 8, 13, 21, ...
// 하노이의 탑
// 조건 : 봉이 3개, 첫번째 봉에서 3번째 봉까지 이동을 시킨다, 블럭을
// 블럭은 한번에 하나만 옮길수 있다.
// 순서는 기존에 쌓여있는 순서와 같게
// 작은 블럭은 큰 블럭 아래에 넣을 수 없다.
// 위의 인원 제외 하고 나머지는 하고싶으면 해라.

// 일요일 저녁 9시까지
